<?php
// $key 不能相等

/*$arr = [
'13.00'=>["姚霞","李敏","周辉","林炯辉","黄昊进","李玉"],
'13.33'=>["姚霞","李敏","周辉","林炯辉","黄昊进","李玉"],
'13.83'=>["姚霞","李鹏飞","周辉","林炯辉","黄昊进","李玉"],
'14.20'=>["姚霞","周辉","林炯辉","黄昊进","李玉"],
'14.50'=>["姚霞","李敏","林炯辉","黄昊进"],
];*/

//备注 林炯辉 68.86元

$arr = [
'13.83'=>["姚霞","李敏","周辉","林炯辉","黄昊进","李玉"],
'14.2'=>["姚霞","李敏","周辉","黄昊进","李玉"],
'12.8'=>["姚霞","李敏","林炯辉","黄昊进"/*,"张舒婷"*/],
'15.33'=>["姚霞","李敏","林炯辉"],
'14.50'=>["姚霞","李敏","林炯辉","黄昊进"],
'13.5'=>["李敏","李鹏飞"],
];


$data = [];
foreach($arr as $price => $names){
	foreach($names as $name){
		$data[$name]  = bcadd($data[$name],$price,2);
	}
}

echo  json_encode($data);

?>
